leetcode_2460_apply_operations_to_an_array.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2460. Apply Operations to an Array</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2460. Apply Operations to an Array</h1>

<div id="outline-container-org7520ede" class="outline-2">
<h2 id="org7520ede">Understand the problem</h2>
<div class="outline-text-2" id="text-org7520ede">
<p>
Given an array \(a\) of non-negative integers.  Simulate the following rules:
</p>

<ul class="org-ul">
<li>\(a[i]=a[i]*2\) and \(a[i+1]=0\) if \(a[i]=a[i+1]\);</li>
<li>\(a[i]\) doesn't change.</li>
</ul>
</div>

<div id="outline-container-orge42de6f" class="outline-3">
<h3 id="orge42de6f">Useful prompts</h3>
<div class="outline-text-3" id="text-orge42de6f">
<ul class="org-ul">
<li><a href="can_we_simulate_the_problem.html#ID-48E699CB-3125-47FF-AA1A-5FCCF0EF235E">Can we simulate the problem?</a>  Since \(2 \leq |a| \leq 2000\), it is fine to simulate the rules.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org34e81e0" class="outline-2">
<h2 id="org34e81e0">Devise a plan</h2>
<div class="outline-text-2" id="text-org34e81e0">
<p>
Simulate the rules while saving the new non-zero values.  After that, we shift all number different than zero to the beginning of the array and fill the rest of the array with zeros.  Time is \(O(n)\) and space is \(O(1)\).
</p>
</div>

<div id="outline-container-org485531b" class="outline-3">
<h3 id="org485531b">Carry out the plan</h3>
<div class="outline-text-3" id="text-org485531b">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">applyOperations</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold; font-style: italic;">List</span>[<span style="font-weight: bold;">int</span>]:
        N = <span style="font-weight: bold;">len</span>(nums)
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
            <span style="font-weight: bold;">if</span> i + 1 &lt; N <span style="font-weight: bold;">and</span> nums[i] == nums[i + 1]:
                nums[i] = nums[i] * 2
                nums[i + 1] = 0
        i = 0
        <span style="font-weight: bold;">for</span> n <span style="font-weight: bold;">in</span> nums:
            <span style="font-weight: bold;">if</span> n &gt; 0:
                nums[i] = n
                i += 1
        <span style="font-weight: bold;">while</span> i &lt; N:
            nums[i] = 0
            i += 1
        <span style="font-weight: bold;">return</span> nums
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>